swat-dp-tools/soma/xml/checkpoint-remove.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request
            domain="@domain.name@"
            xmlns:dp="http://www.datapower.com/schemas/management">
            <dp:do-action>
                <RemoveCheckpoint>
                    <ChkName>@checkpoint.name@</ChkName>
                </RemoveCheckpoint>
            </dp:do-action>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>
